sist/oldSist/SiSTUDDI/teste/xml/find_business.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>  
    <find_business generic="2.0" xmlns="urn:uddi-org:api_v2">    
      <name>%</name>  
    </find_business>
  </s:Body>
</s:Envelope>