saaj-ri/build/test/classes/resources/dynamic11.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><abc:find_service xmlns:abc="urn:uddi-org:api_v2"><name/></abc:find_service></SOAP-ENV:Body></SOAP-ENV:Envelope>
